import discord
from discord import Intents
from discord.ext import commands
import os


class Assistant(commands.Bot):
    banner = """
 █████╗ ███████╗███████╗██╗███████╗████████╗ █████╗ ███╗   ██╗████████╗
██╔══██╗██╔════╝██╔════╝██║██╔════╝╚══██╔══╝██╔══██╗████╗  ██║╚══██╔══╝
███████║███████╗███████╗██║███████╗   ██║   ███████║██╔██╗ ██║   ██║   
██╔══██║╚════██║╚════██║██║╚════██║   ██║   ██╔══██║██║╚██╗██║   ██║   
██║  ██║███████║███████║██║███████║   ██║   ██║  ██║██║ ╚████║   ██║   
╚═╝  ╚═╝╚══════╝╚══════╝╚═╝╚══════╝   ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═══╝   ╚═╝   
"""


    def __init__(self, command_prefix: str, intents: Intents, token:str):
        super().__init__(
            command_prefix=command_prefix,
            intents=intents
        )
        
        self.token = token

    async def load_ext(self):
        for filename in os.listdir("./cmds"):
            await self.load_extension(f"cmds.{filename[:-3]}")

    async def main(self):
        discord.utils.setup_logging()
        await self.start(os.environ["BOT_TOKEN"])

